In [1]:
# split a pandas object into pieces using one or more keys
# calculate group summary stats
# apply within-group transformations, i.e. normalization, linear regression, rank, or subset selection
# compute pivot tables and cross tabulations
# perform quantile analysis and other stat group analyses

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.DataFrame({'key1':['a','a','b','b','a'],
             'key2':['one','two','one','two','one'],
             'data1': np.random.randn(5),
             'data2': np.random.randn(5)})

  key1 key2     data1     data2
0    a  one  0.530161 -1.154213
1    a  two -1.019633  2.154532
2    b  one -0.287947  0.933353
3    b  two  0.137848  1.258100
4    a  one  0.396722  1.518897

In [5]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
             'key2':['one','two','one','two','one'],
             'data1': np.random.randn(5),
             'data2': np.random.randn(5)})

In [8]:
# compute mean of data1 column using labels from key1
# first create the groupby "object". This won't be a calculation yet, but rather a stored procedure for later
grouped = df['data1'].groupby(df['key1'])

In [9]:
grouped.mean()

key1
a   -1.134752
b    0.202307
Name: data1, dtype: float64

In [10]:
df

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674
4    a  one -0.661184 -1.009121

In [15]:
grouped2 = df['data1'].groupby([df['key1'],df['key2']])

In [16]:
grouped2.mean()

key1  key2
a     one    -1.141869
      two    -1.120519
b     one     0.909615
      two    -0.505000
Name: data1, dtype: float64

In [19]:
mean = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [20]:
mean.unstack()

key2       one       two
key1
a    -1.141869 -1.120519
b     0.909615 -0.505000

In [22]:
# the keys can also be any arrays of the right length

states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [26]:
df['data1'].groupby([states,years]).mean()

California  2005   -1.120519
            2006    0.909615
Ohio        2005   -1.063776
            2006   -0.661184
Name: data1, dtype: float64

In [27]:
df

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674
4    a  one -0.661184 -1.009121

In [31]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.141869 -0.388083
     two  -1.120519  1.288503
b    one   0.909615  0.424663
     two  -0.505000  1.370674

In [32]:
# you may wish to know the number of items in the group by (i.e. the count)
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [34]:
df

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674
4    a  one -0.661184 -1.009121

In [33]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
4    a  one -0.661184 -1.009121
b
  key1 key2     data1     data2
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674

In [36]:
oneliner = dict(list(df.groupby('key1')))

In [37]:
oneliner['b']

  key1 key2     data1     data2
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674

In [38]:
oneliner['a']

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
4    a  one -0.661184 -1.009121

In [42]:
# you'll notice that this expresssion and...
df.groupby('key1')['data1'].mean()

key1
a   -1.134752
b    0.202307
Name: data1, dtype: float64

In [44]:
# ... this expression are equivalent
df['data1'].groupby(df['key1']).mean()

key1
a   -1.134752
b    0.202307
Name: data1, dtype: float64

In [45]:
df

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674
4    a  one -0.661184 -1.009121

In [47]:
df.groupby(['key1','key2'])['data2'].mean() #but this operation is much easier to understand

key1  key2
a     one    -0.388083
      two     1.288503
b     one     0.424663
      two     1.370674
Name: data2, dtype: float64

In [51]:
df['data2'].groupby([df['key1'],df['key2']]).mean()  #than this expression

key1  key2
a     one    -0.388083
      two     1.288503
b     one     0.424663
      two     1.370674
Name: data2, dtype: float64

In [55]:
### GROUPING WITH DICTIONARIES AND SERIES ###

pd.DataFrame(np.random.randn(5,5),
            columns=['a','b','c','d','e'],
            index=['Joe','Steve','Wes','Jim','Travis'])

               a         b         c         d         e
Joe     0.515216 -0.151102  0.816383  0.067982  0.665120
Steve   2.947848  0.135966  0.424003  1.572260  0.510093
Wes     1.070291 -0.280260  0.127788 -0.785839  1.930825
Jim    -1.807454 -0.644984  1.201101 -0.454283 -0.786642
Travis -0.771939  1.980884  1.772262 -0.777863  0.684511

In [56]:
people = pd.DataFrame(np.random.randn(5,5),
            columns=['a','b','c','d','e'],
            index=['Joe','Steve','Wes','Jim','Travis'])

In [60]:
people

               a         b         c         d         e
Joe    -0.222030 -1.281945  0.078956 -0.746035  0.891052
Steve   0.551490  1.140891 -0.007579 -1.049745  0.936602
Wes    -0.372019  1.243764  1.967514  0.329453 -1.699935
Jim     0.771497  1.540062  1.501104  0.730443 -1.390569
Travis -0.660482 -0.416078  0.000603  1.291835  0.532318

In [63]:
#add a few Nan values
people.iloc[2:3,[1,2]] = np.nan

In [64]:
people

               a         b         c         d         e
Joe    -0.222030 -1.281945  0.078956 -0.746035  0.891052
Steve   0.551490  1.140891 -0.007579 -1.049745  0.936602
Wes    -0.372019       NaN       NaN  0.329453 -1.699935
Jim     0.771497  1.540062  1.501104  0.730443 -1.390569
Travis -0.660482 -0.416078  0.000603  1.291835  0.532318

In [66]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [69]:
# You can apply the grouping across the rows, by using axis=1
people.groupby(mapping,axis=1).sum()

            blue       red
Joe    -0.667079 -0.612924
Steve  -1.057323  2.628983
Wes     0.329453 -2.071954
Jim     2.231547  0.920990
Travis  1.292438 -0.544242

In [106]:
people.groupby(len).sum() #summing by the length of names

          a         b         c         d         e
3  0.177448  0.258117  1.580060  0.313860 -2.199452
5  0.551490  1.140891 -0.007579 -1.049745  0.936602
6 -0.660482 -0.416078  0.000603  1.291835  0.532318

In [118]:
# heirarchical index

columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                          [1,3,5,1,3]],
                         names=['city','tenor'])
hier = pd.DataFrame(np.random.randn(4,5),columns=columns)

In [119]:
hier

city         US                            JP
tenor         1         3         5         1         3
0      0.846774 -1.817200 -0.259077  1.861163  0.435866
1      1.555328 -1.649692  1.490169 -0.145730 -0.342932
2     -0.284504  0.344590 -1.490611 -0.598735 -1.012874
3      0.200555  1.232060 -0.668291 -2.476029  0.194673

In [121]:
hier.groupby(level='city',axis=1).mean()

city        JP        US
0     1.148514 -0.409834
1    -0.244331  0.465268
2    -0.805804 -0.476842
3    -1.140678  0.254775

In [126]:
df

  key1 key2     data1     data2
0    a  one -1.622553  0.232956
1    a  two -1.120519  1.288503
2    b  one  0.909615  0.424663
3    b  two -0.505000  1.370674
4    a  one -0.661184 -1.009121

In [131]:
df.groupby('key1')['data1'].quantile(0.25)

key1
a   -1.371536
b   -0.151346
Name: data1, dtype: float64

In [133]:
df.groupby('key1').sum()

         data1     data2
key1
a    -3.404256  0.512338
b     0.404615  1.795337

In [134]:
def peak_to_peak(arr):
    return arr.max() - arr.min()      # can make up your own function

In [136]:
df.groupby('key1').agg(peak_to_peak)  # and place that function in here

         data1     data2
key1
a     0.961369  2.297624
b     1.414614  0.946011

In [139]:
grouped = df.groupby('key1')

In [143]:
grouped['data1'].agg('mean')

key1
a   -1.134752
b    0.202307
Name: data1, dtype: float64

In [145]:
df.groupby('key1')['data1'].mean()

key1
a   -1.134752
b    0.202307
Name: data1, dtype: float64

In [146]:
df.groupby(['key1','key2'])['data1'].mean()

key1  key2
a     one    -1.141869
      two    -1.120519
b     one     0.909615
      two    -0.505000
Name: data1, dtype: float64

In [150]:
df.groupby(['key1','key2'])['data1'].agg('var')

key1  key2
a     one     0.462115
      two          NaN
b     one          NaN
      two          NaN
Name: data1, dtype: float64

In [161]:
### FILLING MISSING VALUES WITH GROUP SPECIFIC VALUES

s = pd.Series(np.random.randn(6))

In [162]:
s[2::3] = np.nan

In [163]:
s

0    0.120231
1    0.012183
2         NaN
3    0.894670
4    0.188515
5         NaN
dtype: float64

In [164]:
s.fillna(s.mean())

0    0.120231
1    0.012183
2    0.303899
3    0.894670
4    0.188515
5    0.303899
dtype: float64

In [175]:
states = ['OH','NY','FL','MA','CA','WA','IA','OR']
group_key = ['East'] * 4 + ['West'] * 4

In [176]:
data = pd.Series(np.random.randn(8),index=states)

In [178]:
data[['NY','FL','IA']] = np.nan

In [179]:
data

OH    0.333590
NY         NaN
FL         NaN
MA   -0.615810
CA   -0.973710
WA    1.383688
IA         NaN
OR    0.084022
dtype: float64

In [180]:
data.groupby(group_key).mean() # this applies the mean function to your key, applied in order of the list elements in data

East   -0.141110
West    0.164667
dtype: float64

In [181]:
fill_values = {'East':0.5,'West':-1}

In [183]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [187]:
data.groupby(group_key).apply(fill_func)

OH    0.333590
NY    0.500000
FL    0.500000
MA   -0.615810
CA   -0.973710
WA    1.383688
IA   -1.000000
OR    0.084022
dtype: float64

In [192]:
people['Number'] = [1,4,3,5,2]

In [194]:
people['Profit'] = [3928,9892,10299,63,7627]

In [195]:
people

               a         b         c         d         e  Number  Profit
Joe    -0.222030 -1.281945  0.078956 -0.746035  0.891052       1    3928
Steve   0.551490  1.140891 -0.007579 -1.049745  0.936602       4    9892
Wes    -0.372019       NaN       NaN  0.329453 -1.699935       3   10299
Jim     0.771497  1.540062  1.501104  0.730443 -1.390569       5      63
Travis -0.660482 -0.416078  0.000603  1.291835  0.532318       2    7627

In [197]:
cols = people.columns.tolist()

In [208]:
cols.insert(1,cols.pop(cols.index(cols[2])))

In [210]:
people = people.reindex(columns=cols)

In [216]:
people['Status'] = ['Win','Win','Loss','Loss','Win']

In [220]:
people

,Number,Profit,d,e,a,b,c,Status
Joe,1,3928,-0.746035,0.891052,-0.222030,-1.281945,0.078956,Win
Steve,4,9892,-1.049745,0.936602,0.551490,1.140891,-0.007579,Win
Wes,3,10299,0.329453,-1.699935,-0.372019,NaN,NaN,Loss
Jim,5,63,0.730443,-1.390569,0.771497,1.540062,1.501104,Loss
Travis,2,7627,1.291835,0.532318,-0.660482,-0.416078,0.000603,Win

In [219]:
people.pivot_table(index=['Status'])

          Number  Profit         a         b         c         d         e
Status
Loss    4.000000    5181  0.199739  1.540062  1.501104  0.529948 -1.545252
Win     2.333333    7149 -0.110341 -0.185711  0.023993 -0.167982  0.786657

In [228]:
people.pivot_table(['Profit'],columns=['Status'])

Status  Loss   Win
Profit  5181  7149